---
kind: property
id: P:Autodesk.Revit.DB.AssemblyMemberDifferentCategory.CategoryId1
source: html/aed40ee6-4d73-d3c0-a2f4-38cb290a0a26.htm
---
# Autodesk.Revit.DB.AssemblyMemberDifferentCategory.CategoryId1 Property

Category id of the first assembly member

## Syntax (C#)
```csharp
public ElementId CategoryId1 { get; }
```